[
  {
    "pdf_name": "form1[0].#subform[0].Pt1Line1a_FamilyName[0]",
    "api_name": "form1[0]#subform[0]pt1line1a_familyname[0]",
    "type": "text",
    "alt_text": "NOTE TO ALL APPLICANTS:  If you do not completely fill out this application or fail to submit required documents listed in the Instructions, U.S. Citizenship and Immigration Services (U S C I S) may deny your application. Part 1. Information About You (Person applying for lawful permanent residence). Your Current Legal Name (do not provide a nickname). 1. A. Enter Family Name (Last Name)."
  },
  {
    "pdf_name": "form1[0].#subform[0].Pt1Line1b_GivenName[0]",
    "api_name": "form1[0]#subform[0]pt1line1b_givenname[0]",
    "type": "text",
    "alt_text": "Part 1. Information About You (Person applying for lawful permanent residence). Your Current Legal Name (do not provide a nickname). 1. B. Enter Given Name (First Name)."
  },
  {
    "pdf_name": "form1[0].#subform[0].Pt1Line1c_MiddleName[0]",
    "api_name": "form1[0]#subform[0]pt1line1c_middlename[0]",
    "type": "text",
    "alt_text": "Part 1. Information About You (Person applying for lawful permanent residence). Your Current Legal Name (do not provide a nickname). 1. C. Enter Middle Name."
  },
  {
    "pdf_name": "form1[0].#subform[0].AttorneyStateBarNumber[0]",
    "api_name": "form1[0]#subform[0]attorneystatebarnumber[0]",
    "type": "text",
    "alt_text": "To be completed by an attorney or accredited representative, if any. Enter Attorney State Bar Number, if applicable."
  },
  {
    "pdf_name": "form1[0].#subform[0].CheckBox1[0]",
    "api_name": "form1[0]#subform[0]checkbox1[0]",
    "type": "button",
    "alt_text": "To be completed by an attorney or accredited representative, if any. Select this box if Form G-28 is attached.",
    "options": [
      "1",
      "Off"
    ]
  },
  {
    "pdf_name": "form1[0].#subform[0].VolagNumber[0]",
    "api_name": "form1[0]#subform[0]volagnumber[0]",
    "type": "text",
    "alt_text": "To be completed by an attorney or accredited representative, if any. Enter Volag Number, if any."
  },
  {
    "pdf_name": "form1[0].#subform[0].USCISOnlineAcctNumber[0]",
    "api_name": "form1[0]#subform[0]uscisonlineacctnumber[0]",
    "type": "text",
    "alt_text": "To be completed by an attorney or accredited representative, if any. Enter Attorney or Accredited Representative U S C I S Online Account Number, if any."
  },
  {
    "pdf_name": "form1[0].#subform[0].Pt1Line10_AlienNumber[0]",
    "api_name": "form1[0]#subform[0]pt1line10_aliennumber[0]",
    "type": "text",
    "alt_text": "Enter Alien Registration Number (A. Number). "
  },
  {
    "pdf_name": "form1[0].#subform[0].Pt1Line2a_FamilyName[0]",
    "api_name": "form1[0]#subform[0]pt1line2a_familyname[0]",
    "type": "text",
    "alt_text": "Part 1. Information About You (Person applying for lawful permanent residence). Other Names You Have Used Since Birth (if applicable). NOTE: Provide all other names you have ever used, including your family name at birth, other legal names, nicknames, aliases, and assumed names.  If you need extra space to complete this section, use the space provided in Part 14. Additional Information. 2. A. Enter Family Name (Last Name)."
  },
  {
    "pdf_name": "form1[0].#subform[0].Pt1Line2b_GivenName[0]",
    "api_name": "form1[0]#subform[0]pt1line2b_givenname[0]",
    "type": "text",
    "alt_text": "Part 1. Information About You (Person applying for lawful permanent residence). Other Names You Have Used Since Birth (if applicable). 2. B. Enter Given Name (First Name)."
  },
  {
    "pdf_name": "form1[0].#subform[0].Pt1Line2c_MiddleName[0]",
    "api_name": "form1[0]#subform[0]pt1line2c_middlename[0]",
    "type": "text",
    "alt_text": "Part 1. Information About You (Person applying for lawful permanent residence). Other Names You Have Used Since Birth (if applicable). 2. C. Enter Middle Name."
  },
  {
    "pdf_name": "form1[0].#subform[0].Pt1Line3a_FamilyName[0]",
    "api_name": "form1[0]#subform[0]pt1line3a_familyname[0]",
    "type": "text",
    "alt_text": "Part 1. Information About You (Person applying for lawful permanent residence). Other Names You Have Used Since Birth (if applicable). 3. A. Enter Family Name (Last Name)."
  },
  {
    "pdf_name": "form1[0].#subform[0].Pt1Line3b_GivenName[0]",
    "api_name": "form1[0]#subform[0]pt1line3b_givenname[0]",
    "type": "text",
    "alt_text": "Part 1. Information About You (Person applying for lawful permanent residence). Other Names You Have Used Since Birth (if applicable). 3. B. Enter Given Name (First Name)."
  },
  {
    "pdf_name": "form1[0].#subform[0].Pt1Line3c_MiddleName[0]",
    "api_name": "form1[0]#subform[0]pt1line3c_middlename[0]",
    "type": "text",
    "alt_text": "Part 1. Information About You (Person applying for lawful permanent residence). Other Names You Have Used Since Birth (if applicable). 3. C. Enter Middle Name."
  },
  {
    "pdf_name": "form1[0].#subform[0].Pt1Line5_DateofBirth[0]",
    "api_name": "form1[0]#subform[0]pt1line5_dateofbirth[0]",
    "type": "text",
    "alt_text": "Part 1. Information About You (Person applying for lawful permanent residence). Other Information About You. 5. Enter Date of Birth. Enter as 2 digit month, 2 digit day and 4 digit year. NOTE:  In addition to providing your actual date of birth, include any other dates of birth you have used in connection with any legal names or non-legal names in the space provided in Part 14. Additional Information."
  },
  {
    "pdf_name": "form1[0].#subform[0].Pt1Line6_Gender[0]",
    "api_name": "form1[0]#subform[0]pt1line6_gender[0]",
    "type": "button",
    "alt_text": "Part 1. Information About You (Person applying for lawful permanent residence). Other Information About You. 6. Sex. Select Female.",
    "options": [
      "F",
      "Off"
    ]
  },
  {
    "pdf_name": "form1[0].#subform[0].Pt1Line6_Gender[1]",
    "api_name": "form1[0]#subform[0]pt1line6_gender[1]",
    "type": "button",
    "alt_text": "Part 1. Information About You (Person applying for lawful permanent residence). Other Information About You. 6. Sex. Select Male.",
    "options": [
      "M",
      "Off"
    ]
  },
  {
    "pdf_name": "form1[0].#subform[0].Pt1Line4a_FamilyName[0]",
    "api_name": "form1[0]#subform[0]pt1line4a_familyname[0]",
    "type": "text",
    "alt_text": "Part 1. Information About You (Person applying for lawful permanent residence). Other Names You Have Used Since Birth (if applicable). 4. A. Enter Family Name (Last Name)."
  },
  {
    "pdf_name": "form1[0].#subform[0].Pt1Line4b_GivenName[0]",
    "api_name": "form1[0]#subform[0]pt1line4b_givenname[0]",
    "type": "text",
    "alt_text": "Part 1. Information About You (Person applying for lawful permanent residence). Other Names You Have Used Since Birth (if applicable). 4. B. Enter Given Name (First Name)."
  },
  {
    "pdf_name": "form1[0].#subform[0].Pt1Line4c_MiddleName[0]",
    "api_name": "form1[0]#subform[0]pt1line4c_middlename[0]",
    "type": "text",
    "alt_text": "Part 1. Information About You (Person applying for lawful permanent residence). Other Names You Have Used Since Birth (if applicable). 4. C. Enter Middle Name."
  },
  {
    "pdf_name": "form1[0].#subform[0].Pt1Line6_CityOrTown[0]",
    "api_name": "form1[0]#subform[0]pt1line6_cityortown[0]",
    "type": "text",
    "alt_text": "Part 1. Information About You (Person applying for lawful permanent residence). Other Information About You. 7. Enter City or Town of Birth."
  },
  {
    "pdf_name": "form1[0]",
    "api_name": "form1[0]",
    "type": "",
    "alt_text": null
  }
]